---
kind: type
id: T:Autodesk.Revit.DB.ITransactionFinalizer
source: html/e11d1d5a-00dc-a13f-55b5-4e2fc679f591.htm
---
# Autodesk.Revit.DB.ITransactionFinalizer

An interface that may be used to perform a custom action at the end of a transaction.
 A method of the interface will be called when a transaction is either committed or rolled back.

## Syntax (C#)
```csharp
public interface ITransactionFinalizer
```